# 1.序列，列表 元组，字符串都是序列，序列的分片：序列[起始索引：结束索引:n]指的是 从起始位置开始取数，每隔n-1个位置取出一个数。
# 直到结束索引 省略不写的话就是 默认从0开始，结束位置就是末尾，步长为1 结束位置超过长度不会报错 默认为末尾的位置
list1=[1,2,3,4,5,6,7,8,9]
print(list1[1:9:])
print(list1[::2])
print(list1[::-1])
print(list1[::])
print(list1[:11:])
# 当起始的索引大于结束的索引的时候 步长就必须为负数
print(list1[8:4:-1])

# 元组的与字符串的切片与上面同样
t1=(1,2,3,4,5,2,6)
print(t1[0:8:2])

str1='hhhhjjjjkkkk'
print(str1[::2])

s1={10,20,30,40,50,60,70,80,90,100}
s2={40,50,60,70,80,90,100}
print("数学运算交并差")
# 并集
print(s1 | s2)
# 交集
print(s1 & s2)
# 差集
print(s1 -s2)
# 对称差集
print(s1 ^s2)
